# SetSystemType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Pipe..::..SetSystemType Method
Pipe Class See Also
---
Updates the associated system type for the pipe.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void SetSystemType(
	ElementId systemTypeId
)
```

Visual Basic
---
```text
Public Sub SetSystemType ( _
	systemTypeId As ElementId _
)
```

Visual C++
---
```text
public:
void SetSystemType(
	ElementId^ systemTypeId
)
```

# ### Parameters
systemTypeId
    Type: Autodesk.Revit.DB..::..ElementId The ElementId of the piping system type.
# Remarks
If the pipe previously did not have a system associated to it, this will create a new system.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The systemTypeId is not valid piping system type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace